bench-results/2016050301/03-etcdv2-result.log
nohup: ignoring input

2016/05/03 23:30:42 Step 1: starting databases...
2016/05/03 23:30:42 [0] Start etcdv2 at 10.240.0.25:3500
2016/05/03 23:30:42 [0] Response from 10.240.0.25:3500 (success:true )
2016/05/03 23:30:43 [1] Start etcdv2 at 10.240.0.26:3500
2016/05/03 23:30:43 [1] Response from 10.240.0.26:3500 (success:true )
2016/05/03 23:30:44 [2] Start etcdv2 at 10.240.0.27:3500
2016/05/03 23:30:44 [2] Response from 10.240.0.27:3500 (success:true )

2016/05/03 23:30:50 Step 2: starting tests...
 0 / 400000 B                                                                                !   0.00%2016/05/03 23:30:50 finalize has started
 400000 / 400000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 36s

Summary:
  Total:	36.7287 secs.
  Slowest:	1.0013 secs.
  Fastest:	0.0029 secs.
  Average:	0.0688 secs.
  Stddev:	0.1237 secs.
  Requests/sec:	10630.8059

Response time histogram:
  0.003 [1]	|
  0.103 [335095]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.203 [17464]	|∎∎
  0.302 [17424]	|∎∎
  0.402 [8711]	|∎
  0.502 [3216]	|
  0.602 [2884]	|
  0.702 [2318]	|
  0.802 [1365]	|
  0.901 [860]	|
  1.001 [1118]	|

Latency distribution:
  10% in 0.0164 secs.
  25% in 0.0200 secs.
  50% in 0.0262 secs.
  75% in 0.0396 secs.
  90% in 0.1971 secs.
  95% in 0.3079 secs.
  99% in 0.6692 secs.
unix_ts,avg_latency_ms,throughput
1462318250,25.081219,17740
1462318251,25.727674,37097
1462318252,33.265627,28559
1462318253,39.222608,25293
1462318254,47.807137,21115
1462318255,57.773215,16989
1462318256,51.604976,17792
1462318257,48.350767,18461
1462318258,66.262758,17161
1462318259,70.363341,12952
1462318260,73.415914,12190
1462318261,84.436024,13288
1462318262,96.236628,10918
1462318263,81.876260,12704
1462318264,77.542048,11502
1462318265,118.510194,9363
1462318266,88.335202,11120
1462318267,104.264869,8532
1462318268,412.810408,2237
1462318269,119.900962,9152
1462318270,82.843401,10241
1462318271,125.162244,5199
1462318272,623.746940,600
1462318273,748.869410,250
1462318274,951.270495,181
1462318275,939.701362,128
1462318276,0.000000,0
1462318277,0.000000,0
1462318278,0.000000,0
1462318279,0.000000,0
1462318280,161.694557,795
1462318281,37.938034,17506
1462318282,69.854218,8561
1462318283,140.625366,4581
1462318284,110.153684,10289
1462318285,80.489418,8603
1462318286,98.763104,8691
1462318287,888.752225,666

2016/05/03 23:31:27 time series saved... Uploading to Google cloud storage...
2016/05/03 23:31:27 Uploading timeseries.csv to 2016050301/03-etcdv2-timeseries.csv
UploadFile:

timeseries.csv
--->
2016050301/03-etcdv2-timeseries.csv


UploadFile Done!

2016/05/03 23:31:28 Uploading result.log to 2016050301/03-etcdv2-result.log
UploadFile:

result.log
--->
2016050301/03-etcdv2-result.log